{"id":291,"date":"2021-06-05T15:27:15","date_gmt":"2021-06-05T20:27:15","guid":{"rendered":"http:\/\/moonrockdlbba.flywheelsites.com\/?page_id=291"},"modified":"2022-09-21T14:18:56","modified_gmt":"2022-09-21T19:18:56","slug":"terms-of-use","status":"publish","type":"page","link":"https:\/\/euclidfs.com\/terms-of-use\/","title":{"rendered":"Terms of Use"},"content":{"rendered":"\n<h2>Terms of Use<\/h2>\t\t\t\n\t\t\t\t<p>All information available through this website is the property of Euclid Financial Services (the &#8220;Company&#8221;) or its information providers and is protected by copyright and intellectual property laws. All rights reserved.<\/p>\n<p>You may not reproduce, retransmit, disseminate, sell, publish, broadcast, nor shall the information be used in connection with creating, promoting, trading or marketing financial instruments or products without the express written consent of Euclid Financial Services or its licensors. You are entitled to use the information it contains for your private, non-commercial use only.<\/p>\n<p>Euclid Financial Services operates this website (the &#8220;website&#8221;) to provide information, related features and services (the &#8220;Service&#8221;). The terms and conditions set forth herein (the &#8220;Terms of Use&#8221;) constitute a legally binding agreement between the Company and you regarding the terms on which the Company offers you access to Service.<\/p>\n<p>Please take a few minutes to review the Terms of Use. By accessing and using this website, you agree to be bound by each of the Terms of Use and all applicable laws and regulations governing the website. If you do not agree with any of the Terms of Use, you are not authorized to access or use this website for any purpose.<\/p>\n<ol>\n<li><strong>Contents not intended for distribution or use where prohibited<\/strong><strong><br><\/strong>The information provided on this website is not intended for distribution to, or use by, any person or entity in any jurisdiction or country where such distribution or use would be contrary to law or regulation or which would subject the Company to any registration requirement within such jurisdiction or country. Neither the information, nor any opinion contained in this website, constitutes a solicitation or offer by the Company to buy or sell any securities, futures, options or other financial instruments or provide any investment advice or service.<\/li>\n<li><strong>These terms of use may change without prior notice<\/strong><strong><br><\/strong>The Company reserves the right to modify these Terms of Use at any time without giving you prior notice. Your use of the website following any such modification constitutes your agreement to follow and be bound by the Terms of Use as modified. For this reason, we encourage you to review these Terms of Use whenever you use this website. The last date these Terms of Use were revised is set forth below.<\/li>\n<li><strong>Notices of restrictions on your use<\/strong><strong><br><\/strong>The Service, the website and all data and information and\/or content that you see, hear or otherwise experience on the website (the &#8220;Content&#8221;) belongs to the Company, its partners, affiliates, contributors or third parties and may be protected by U.S. and international copyright, trademark, intellectual property and other laws. Content provided by third parties is used on the website with the permission of such third parties. You may download, print and store selected portions of the Content, provided that you (1) do not copy or post the Content on any network computer or transmit, distribute, publish or broadcast the Content in any media, including without limitation, a website; and (2) do not modify or alter the Content in any way, or delete or change any copyright or trademark notice. No right, title or interest in any copied or downloaded Content is transferred to you as a result of any such copying or downloading. The Company reserves complete title and full intellectual property rights in any Content you copy or download from this website. You agree not to alter, modify, reformat, copy, download, reproduce, duplicate, display, distribute, repost, transmit, publish, license, sell, rent, transfer or create derivative works from any Content obtained from the website or the Service, except as expressly permitted by these Terms of Use. Moreover, you may not use any of the marks appearing throughout this website without express written consent from the trademark owner, except as permitted by applicable law.<\/li>\n<li><strong>Disclaimer of warranties<\/strong><strong><br><\/strong>By agreeing to grant you access, the Company does not obligate ourselves to do so or to maintain this site, or to maintain it in its present form, and we expressly reserve the right to modify, suspend or terminate your access privileges.&nbsp;You agree and understand that we may, in our sole discretion and without any prior notice, close this website or deny you access to it and delete any files which you may maintain at this site and any information which you may choose to post here. The information on this website is provided &#8220;as is.&#8221; You expressly agree to assume total responsibility and risk for your use of the website and the service. The company makes no express or implied warranties, representations or endorsements whatsoever with respect to the website or the service. The company expressly disclaims all warranties of any kind, express, implied, statutory or otherwise, including, but not limited to, implied warranties of merchantability, fitness for a particular purpose, title and noninfringement, with regard to the website, the service or any information or content contained therein (including third-party information). The company shall not be liable for any loss or damage arising either directly or indirectly from any use of the website, the service or any information or content contained therein (including third-party information). It is solely your responsibility to evaluate the accuracy, completeness and usefulness of all information or content provided by the website or the service.<\/li>\n<\/ol>\n<p>The company does not warrant that the functions performed by the website or the service will be uninterrupted, timely, secure or error-free, or that defects in the website or the service will be corrected. The company does not warrant the accuracy or completeness of the information or content provided by the website or the service, or that any errors in the information or content will be corrected. The website, the service and the information or content are provided on an &#8220;as is&#8221; and &#8220;as available&#8221; basis.<\/p>\n<ol start=\"5\">\n<li><strong>Limitation of liability<\/strong><strong><br><\/strong>If you are dissatisfied with the website or any content on the website, or with the terms of use, your sole and exclusive remedy is to discontinue using the website. You acknowledge, by your use of the website, that your use of the website is at your sole risk. You understand and agree that under no circumstances will the company be liable for any damages whatsoever, including, but not limited to, (i) any direct, incidental, consequential, exemplary or indirect damages (including, but not limited to, damages for loss of business profits, business interruption, loss of data, programs or information, and the like) arising out of the use of or inability to use the website, the service, or the information or content provided therein, (ii) any claim attributable to errors, omissions or other inaccuracies in the website, the service and\/or information or content contained therein or downloaded through the website, (iii) unauthorized access to or alteration of your transmissions or data, (iv) statements or conduct of any third party on the website or the service, or (v) any other matter relating to the website or the service, even if the company has been advised of the possibility of such damages. Because some states do not allow the exclusion or limitation of liability for consequential or incidental damages, some of the above limitations may not apply to you. In such states, the company&#8217;s liability is limited and warranties are excluded to the greatest extent permitted by law.\n<ol>\n<li><strong>Personal information and Privacy Policy<\/strong><\/li>\n<li><a href=\"http:\/\/euclidfs.com\/privacy-policy\/\"><strong>Click here <\/strong><\/a><strong>to see our Privacy Policy<\/strong><\/li>\n<li><strong>User conduct<\/strong><\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<p>You agree not to take any action that interferes with the proper working of the website; imposes an unreasonable or disproportionately large load on the website&#8217;s infrastructure; might compromise the security of the website; render the website or the Service inaccessible to others; or otherwise cause damage to the website or any Content contained on the website. You agree not to add to, subtract from or otherwise modify the Content on the website except as expressly authorized by the Company in these Terms of Use or by a written agreement between you and the Company.<\/p>\n<ol start=\"6\">\n<li><strong>General provisions<\/strong>\n<ol>\n<li>Entire agreement.&nbsp;These Terms of Use constitute the entire agreement of the parties with respect to the subject matter hereof, and supersede all previous written or oral agreements between the parties with respect to such subject matter. No waiver by the Company of any breach or default hereunder shall be deemed to be a waiver of any preceding or subsequent breach or default.<\/li>\n<li>Correction of errors and inaccuracies.&nbsp;The information in the website may contain typographical errors or other errors or inaccuracies and may not be complete or current. We therefore reserve the right to correct any errors, inaccuracies or omissions and to change or update information at any time without prior notice. We do not, however, guarantee that any errors, inaccuracies or omissions will be corrected.<\/li>\n<li>No endorsements of links. Hypertext links to third-party websites or information do not constitute or imply an endorsement, sponsorship or recommendation by the Company of the third party, the third-party website or the information contained therein. You acknowledge and agree that the Company is not responsible for the availability of any such websites and that the Company does not endorse or warrant, and is not responsible or liable for any such website or the content therein. Any links to other sites are provided for convenience only. You need to make your own decisions regarding your interactions or communications with any other website.<\/li>\n<li>If any part of these Terms of Use is determined to be invalid or unenforceable, it will not impact any other provision of these Terms of Use, all of which will remain in full force and effect. These Terms of Use are governed by, and will be interpreted in accordance with, the laws of the state of Rhode Island, without regard to any conflict of laws&#8217; provisions. Although you acknowledge that we will have the ability to enforce our rights in any court of competent jurisdiction, you hereby consent to the exclusive jurisdiction and venue of courts in Rhode Island, U.S.A., regarding any and all disputes relating to these Terms of Use, the Company&#8217;s Privacy Statement, your use of the website, any other website, the Service, or Content or Material contained therein.<\/li>\n<\/ol>\n<\/li>\n<li><strong>User conduct<\/strong><strong><br><\/strong>You agree not to take any action that interferes with the proper working of the website; imposes an unreasonable or disproportionately large load on the website&#8217;s infrastructure; might compromise the security of the website; render the website or the Service inaccessible to others; or otherwise cause damage to the website or any Content contained on the website. You agree not to add to, subtract from, or otherwise modify the Content on the website except as expressly authorized by the Company in these Terms of Use or by a written agreement between you and the Company.<\/li>\n<\/ol>\n<!--d574a17a-->","protected":false},"excerpt":{"rendered":"<p>Terms of Use All information available through this website is the property of Euclid Financial Services (the &#8220;Company&#8221;) or its information providers and is protected by copyright and intellectual property laws. All rights reserved. You may not reproduce, retransmit, disseminate, sell, publish, broadcast, nor shall the information be used in connection with creating, promoting, trading [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","site-sidebar-layout":"no-sidebar","site-content-layout":"page-builder","ast-site-content-layout":"","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"disabled","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"disabled","site-post-title":"disabled","ast-breadcrumbs-content":"disabled","ast-featured-img":"disabled","footer-sml-layout":"disabled","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"footnotes":"","_links_to":"","_links_to_target":""},"class_list":["post-291","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/pages\/291"}],"collection":[{"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/comments?post=291"}],"version-history":[{"count":8,"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/pages\/291\/revisions"}],"predecessor-version":[{"id":40806,"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/pages\/291\/revisions\/40806"}],"wp:attachment":[{"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/media?parent=291"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}