{"id":3,"date":"2021-05-30T16:36:46","date_gmt":"2021-05-30T16:36:46","guid":{"rendered":"http:\/\/moonrockdlbba.flywheelsites.com\/?page_id=3"},"modified":"2022-09-21T14:16:41","modified_gmt":"2022-09-21T19:16:41","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/euclidfs.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\n<h2>Privacy Policy<\/h2>\t\t\t\n\t\t\t\t<p><em>Last Modified: 03\/19\/2018<\/em><\/p>\n<p>Protecting your privacy is very important to us. Our goal is to treat the personal information you furnish us with the utmost respect and in accordance with this Privacy Policy.&nbsp;We request that you carefully read this Privacy Policy and our Terms of Use before using the website. By visiting, viewing or using the website in any manner, you are agreeing to the terms set forth in this Privacy Policy, as well as the Terms of Use for the website.<\/p>\n<p>This policy describes the types of personally identifiable information (&#8220;PII&#8221;) and non-personally identifiable information (&#8220;Non-PII&#8221;) we may collect from you or that you may provide when you visit our website and our practices for collecting, using, maintaining, protecting and disclosing that information. PII includes information such as your name, address, phone number, ZIP code, email address and similar information. Non-PII is non-personally identifiable information, and may include, for example, your IP address, browser type, domain names, access dates and similar information.<\/p>\n<strong><u>Personal Information We Collect and How We Collect It<\/u><\/strong><br>\nYou can visit us on the internet without telling us who you are or revealing any information about yourself, including your email address. In this case, our web servers may collect the name of the domain you used to access the internet (such as aol.com) and the website you came from and visit next. This information is used by us and our business partners to measure the number of visits, average time spent, page views and other statistics about visitors to our website in general. We also use this data to monitor site performance and to make the site easier and more convenient to use.\n<p>There are times when we may ask you for information about yourself to assist us in meeting your various needs. In these cases, your browsing will no longer be anonymous to us. To provide these services, we may need to ask you directly to provide, among other things, your name, Social Security number, physical address, ZIP code, email address and phone number.<\/p>\n<p>Please note that we do not knowingly solicit information from children and we do not knowingly market our products or services to children.<\/p>\n<strong><u>How We Use Your Information<\/u><\/strong><br>\nWe may use information that we collect about you or that you provide to us, including any personal information, for any purpose including, but not limited to:\n<ul>\n<li>Providing you with materials you have requested<\/li>\n<li>Contacting you for the potential purchase of insurance or other financial products<\/li>\n<li>Personalizing our contact with you<\/li>\n<li>Operating, providing, improving and maintaining our website<\/li>\n<li>Developing new products and services<\/li>\n<li>Preventing abusive and fraudulent use of our website<\/li>\n<li>Sending you administrative messages, content and other services and features in which we believe you may be interested<\/li>\n<li>Any other administrative and internal business purposes permitted by law<\/li>\n<\/ul>\n<strong><u>Protection of Your Information<\/u><\/strong><br>\nWe maintain a variety of security measures to protect against the loss, misuse and alteration of information under our control. Although we make good-faith efforts to maintain the security of such information, we cannot guarantee that it will remain free from unauthorized access, use, disclosure or alteration. Further, we cannot guarantee that our security measures will prevent unauthorized persons from accessing or obtaining this information. We assume no liability to you or any other party in relation to the unauthorized access, use or alteration of any information provided to us.\n<strong><u>Notification in the Event of Data Breach<\/u><\/strong><br>\nAs previously stated, although we make good-faith efforts to maintain the security of your information, we cannot guarantee that it will remain free from unauthorized access, use, disclosure or alteration. In the event your personally identifiable information is breached by an unauthorized party, we will comply with your applicable state law in notifying you of the breach.\n<strong><u>Accessing or Correcting Your Information<\/u><\/strong><br>\nYou may access the data collected by us about you by sending a request to the address listed below. If you believe that an error has been made in the accuracy of the information collected from you, we will correct such error upon adequate verification of the error and the identity of the person seeking the correction.\n<p>If you wish to access, remove or correct any personally identifying information you have supplied to us or if you have any questions about this Privacy Policy, you may contact us by sending a letter via the U.S. Mail to: 225 Newman Ave., Suite 303, East Providence, RI 02916. Please understand that to protect your privacy and security, we may also need to take reasonable steps to verify your identity before granting access or making corrections.<\/p>\n<strong><u>Sharing Information and Consumer Choice<\/u><\/strong><br>\nWhen you provide information to us, we may share your information, to the extent provided by applicable law, with our affiliated companies and third parties for the purpose of fulfilling your requests as well as offering you other services that may be of interest to you. It is not shared with any third party, unless requested by you or permitted by law. Under no circumstance will we sell your information or transfer your information to any ad network, ad exchange, data broker or other advertising or monetization related service. We may also aggregate statistics that we gather about our customers, sales, traffic patterns and services, and provide these statistics to third parties; however, when we do, these statistics will not include any personal information that identifies individuals.\n<strong><u>Cookies<\/u><\/strong><br>\nIf you are browsing, a cookie is used to help us measure the number of visits, average time spent, page views and other statistics relating to our website. This cookie, by itself, does not reveal to us your email address or who you are. If you decide to register online with us, we may collect additional information to provide tailored offerings or content to you. In this case, we use cookies to recognize you on subsequent visits and make your online experience more convenient.\n<p>Cookies are small pieces of data stored by your internet browser on your computer&#8217;s hard drive. They cannot be used to collect data from your hard drive, obtain your email address or personal identifying information about you. You may set your browser to notify you when you receive a cookie or to prevent cookies from being sent. Please note, however, that by not accepting cookies, you will limit the functionality we can provide you when you visit our site.<\/p>\n<strong><u>Handling of &#8216;Do Not Track&#8217; Signals<\/u><\/strong><br>\nThe California Online Privacy Protection Act provides that a website operator must:\n<p>&#8220;Disclose how the operator responds to web browser &#8216;do not track&#8217; signals or other mechanisms that provide consumers the ability to exercise choice regarding the collection of personally identifiable information about an individual consumer&#8217;s online activities over time and across third-party websites or online services, if the operator engages in that collection.&#8221;<\/p>\n<p>It is important for you to know that we do not engage in the type of collection referenced in the California law.<\/p>\n<strong><u>Changes to This Privacy Policy<\/u><\/strong><br>\nWe reserve the right to modify or supplement this Privacy Policy statement at any time. If we make any material change, we will update our website to include such changes. A notice that our privacy policy has been updated will be displayed on our website homepage. You are responsible for periodically visiting our website and this privacy policy to check for any changes.\n<strong><u>Contact Information<\/u><\/strong><br>\nTo ask questions or comment about this privacy policy and our privacy practices, contact us at:\n<a href=\"mailto:ask@euclidfs.com\">ask@euclidfs.com<\/a><br>\nor<br>\n401.727.2727\n","protected":false},"excerpt":{"rendered":"<p>Privacy Policy Last Modified: 03\/19\/2018 Protecting your privacy is very important to us. Our goal is to treat the personal information you furnish us with the utmost respect and in accordance with this Privacy Policy.&nbsp;We request that you carefully read this Privacy Policy and our Terms of Use before using the website. By visiting, viewing [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":{"_seopress_robots_primary_cat":"","_seopress_titles_title":"","_seopress_titles_desc":"","_seopress_robots_index":"","site-sidebar-layout":"no-sidebar","site-content-layout":"page-builder","ast-site-content-layout":"","site-content-style":"default","site-sidebar-style":"default","ast-global-header-display":"","ast-banner-title-visibility":"","ast-main-header-display":"disabled","ast-hfb-above-header-display":"","ast-hfb-below-header-display":"","ast-hfb-mobile-header-display":"disabled","site-post-title":"disabled","ast-breadcrumbs-content":"disabled","ast-featured-img":"disabled","footer-sml-layout":"disabled","theme-transparent-header-meta":"default","adv-header-id-meta":"","stick-header-meta":"","header-above-stick-meta":"","header-main-stick-meta":"","header-below-stick-meta":"","astra-migrate-meta-layouts":"default","ast-page-background-enabled":"default","ast-page-background-meta":{"desktop":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"ast-content-background-meta":{"desktop":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"tablet":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""},"mobile":{"background-color":"var(--ast-global-color-5)","background-image":"","background-repeat":"repeat","background-position":"center center","background-size":"auto","background-attachment":"scroll","background-type":"","background-media":"","overlay-type":"","overlay-color":"","overlay-opacity":"","overlay-gradient":""}},"footnotes":"","_links_to":"","_links_to_target":""},"class_list":["post-3","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/pages\/3"}],"collection":[{"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/comments?post=3"}],"version-history":[{"count":8,"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/pages\/3\/revisions"}],"predecessor-version":[{"id":40805,"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/pages\/3\/revisions\/40805"}],"wp:attachment":[{"href":"https:\/\/euclidfs.com\/wp-json\/wp\/v2\/media?parent=3"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}